app/controllers/posts_controller.rb

  def index
    # @posts = Post.all
    @posts = Post.paginate(:page => params[:page])
---
SELECT "posts".* FROM "posts" LIMIT 30 OFFSET 30
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("comment_status", "created_at", "guid", "ping_status", "pinged", "post_content", "post_content_filtered", "post_date", "post_date_gmt", "post_excerpt", "post_id", "post_mime_type", "post_modified", "post_modified_gmt", "post_name", "post_password", "post_status", "post_title", "post_type", "to_ping", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)