app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "salt", "updated_at", "user_email", "user_login", "user_pass") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.create(:user_login => params[:user_login], :user_email => params[:user_email],:password => params[:password])