app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "display_name", "updated_at", "user_activation_key", "user_email", "user_id", "user_login", "user_nicename", "user_pass", "user_registered", "user_url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)